# WallBottomIsAttached Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..WallBottomIsAttached Property
ParameterTypeId Class See Also
---
"Base is Attached"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId WallBottomIsAttached { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WallBottomIsAttached As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WallBottomIsAttached {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace